src/test/resources/artifacts/ESB/config/soapRequests/sapbydesign/apiQueryCustomerByIdentification.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:a03="http://sap.com/xi/AP/CustomerExtension/BYD/A03Z2" xmlns:glob="http://sap.com/xi/SAPGlobal20/Global" xmlns:glob1="http://sap.com/xi/AP/Globalization">
    <soap:Header />
    <soap:Body>
        <glob:CustomerByIdentificationQuery_sync>
            <CustomerSelectionByIdentification>
                <SelectionByUUID>
                    <IntervalBoundaryTypeCode>1</IntervalBoundaryTypeCode>
                    <LowerBoundaryUUID>%s(customerUUID)</LowerBoundaryUUID>
                </SelectionByUUID>
            </CustomerSelectionByIdentification>
        </glob:CustomerByIdentificationQuery_sync>
    </soap:Body>
</soap:Envelope>